Ran Plan for dir: `newrelic` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # newrelic_alert_policy.media-alerts will be created
+ resource "newrelic_alert_policy" "media-alerts" {
      + account_id          = (known after apply)
      + id                  = (known after apply)
      + incident_preference = "PER_CONDITION_AND_TARGET"
      + name                = "Media Alerts"
    }

  # newrelic_alert_policy_channel.bitcoin-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "bitcoin-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4704704,
          + 4704703,
        ]
      ~ id          = "1205036:4704703:4704704" -> (known after apply)
        policy_id   = 1205036
    }

  # newrelic_alert_policy_channel.media-alerts will be created
+ resource "newrelic_alert_policy_channel" "media-alerts" {
      + channel_ids = [
          + 4704704,
          + 4704703,
        ]
      + id          = (known after apply)
      + policy_id   = (known after apply)
    }

  # newrelic_alert_policy_channel.server-alerts must be replaced
-/+ resource "newrelic_alert_policy_channel" "server-alerts" {
      ~ channel_ids = [ # forces replacement
          - 4704703,
            4704704,
          + 4704703,
        ]
      ~ id          = "1205037:4704703:4704704" -> (known after apply)
        policy_id   = 1205037
    }

  # newrelic_nrql_alert_condition.deluge-not-running will be created
+ resource "newrelic_nrql_alert_condition" "deluge-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "Deluge is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'Deluge'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.motion-not-running will be created
+ resource "newrelic_nrql_alert_condition" "motion-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "Motion is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'motion'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.motioneye-not-running will be created
+ resource "newrelic_nrql_alert_condition" "motioneye-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "MotionEye is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'motioneye'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.nextcloud-not-running will be created
+ resource "newrelic_nrql_alert_condition" "nextcloud-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "NextCloud is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'NextCloud'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.nextcloudcache-not-running will be created
+ resource "newrelic_nrql_alert_condition" "nextcloudcache-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "NextCloudCache is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'NextCloudCache'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.nextclouddb-not-running will be created
+ resource "newrelic_nrql_alert_condition" "nextclouddb-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "NextCloudDB is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'NextCloudDB'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.nginx-not-running will be created
+ resource "newrelic_nrql_alert_condition" "nginx-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "NGINX is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'Nginx'
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.plex-not-running will be created
+ resource "newrelic_nrql_alert_condition" "plex-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "Plex is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM K8sContainerSample,ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE (entityName LIKE '%plex%' OR containerName LIKE '%plex%')
                      FACET host 
            EOT
        }
    }

  # newrelic_nrql_alert_condition.sickchill-not-running will be created
+ resource "newrelic_nrql_alert_condition" "sickchill-not-running" {
      + account_id                     = 3020622
      + aggregation_window             = 60
      + close_violations_on_expiration = false
      + enabled                        = true
      + expiration_duration            = 120
      + id                             = (known after apply)
      + name                           = "SickChill is not running"
      + open_violation_on_expiration   = false
      + policy_id                      = (known after apply)
      + type                           = "static"
      + value_function                 = "single_value"
      + violation_time_limit           = (known after apply)
      + violation_time_limit_seconds   = 3600

      + critical {
          + operator              = "equals"
          + threshold             = 0
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + evaluation_offset = 3
          + query             = <<~EOT
                      FROM ContainerSample
                      SELECT uniqueCount(entityName)
                      WHERE entityName LIKE 'SickChill'
                      FACET host 
            EOT
        }
    }

Plan: 13 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d newrelic`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.qtosw.com/lock?id=tyzbit%252Fterraform%252Fnewrelic%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d newrelic`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
